#### WallPaint Members

---

|  |
| --- |
| WallPaint Class   Properties   See Also |

The  WallPaint  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "WallPaint" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "WallPaint" schema. |
| Public property Static member | WallpaintApplication | The property labeled "Application" from the "WallPaint" schema. |
| Public property Static member | WallpaintColor | The property labeled "Color" from the "WallPaint" schema. |
| Public property Static member | WallpaintFinish | The property labeled "Finish" from the "WallPaint" schema. |

# See Also

WallPaint Class

Autodesk.Revit.DB.Visual Namespace